applications/rhoFixedFlowFoam/tests/phaseChange/closedBox/system/controlDict
/*------------------------------------------------------------------------------

system/controlDict of tests/phaseChange/closedBox

  dt = 4 ms, 10 steps, every step written in ascii with 17 digits so that
  the closed form Y^n = Y0/(1 + lambda dt)^n can be checked to 1e-14.

------------------------------------------------------------------------------*/
FoamFile {version 2.0; format ascii; class dictionary; object controlDict;}

application       rhoFixedFlowFoam;
startFrom         latestTime;
startTime         0;
stopAt            endTime;
endTime           0.04;
deltaT            0.004;
writeControl      timeStep;
writeInterval     1;
purgeWrite        0;
writeFormat       ascii;
writePrecision    17;
writeCompression  off;
timeFormat        general;
timePrecision     6;
runTimeModifiable false;

speciesTransport {
  tolerance          1e-5;
  nCorr              3;
  writeFrozenFields  no;
}
