applications/rhoFixedFlowFoam/tests/phaseChange/closedBox/0/T
FoamFile {version 2.0; format ascii; class volScalarField; object T;}
dimensions    [0 0 0 1 0 0 0];
internalField uniform 500;
boundaryField {
  "(INLET|OUTLET|WALL|TOP)" {type calculated; value uniform 500;}
  FRONTBACK {type empty;}
}
