applications/rhoFixedFlowFoam/tests/phaseChange/closedBox/0/Y_PbI2_g
FoamFile {version 2.0; format ascii; class volScalarField; object Y_PbI2_g;}
dimensions    [0 0 0 0 0 0 0];
internalField uniform 1e-3;
boundaryField {
  "(INLET|OUTLET|WALL|TOP)" {type zeroGradient;}
  FRONTBACK {type empty;}
}
